export class ChapterNames {

    static chapNamesInTamil = [
        'ஆதியாகமம்', 'யாத்திராகமம்', 'லேவியராகமம்', 'எண்ணாகமம்', 'உபாகமம்', 'யோசுவா', 'நியாயாதிபதிகள்', 'ரூத்', '1 சாமுவேல்',
        '2 சாமுவேல்', '1 இராஜாக்கள்', '2 இராஜாக்கள்', '1 நாளாகமம்', '2 நாளாகமம்', 'எஸ்றா', 'நெகேமியா', 'எஸ்தர்', 'யோபு',
        'சங்கீதம்', 'நீதிமொழிகள்', 'பிரசங்கி', 'உன்னதப்பாட்டு', 'ஏசாயா', 'எரேமியா', 'புலம்பல்', 'எசேக்கியேல்', 'தானியேல்', 'ஓசியா',
        'யோவேல்', 'ஆமோஸ்', 'ஒபதியா', 'யோனா', 'மீகா', 'நாகூம்', 'ஆபகூக்', 'செப்பனியா', 'ஆகாய்', 'சகரியா', 'மல்கியா',
        'மத்தேயு', 'மாற்கு', 'லுூக்கா', 'யோவான்', 'அப்போஸ்தலர்', 'ரோமர்', '1 கொரிந்தியர்', '2 கொரிந்தியர்', 'கலாத்தியர்',
        'எபேசியர்', 'பிலிப்பியர்', 'கொலோசெயர்', '1 தெசலோனிக்கேயர்', '2 தெசலோனிக்கேயர்', '1 தீமோத்தேயு', '2 தீமோத்தேயு', 'தீத்து',
        'பிலேமோன்', 'எபிரெயர்', 'யாக்கோபு', '1 பேதுரு', '2 பேதுரு', '1 யோவான்', '2 யோவான்', '3 யோவான்', 'யூதா', 'வெளி'
    ];

    static chapNamesInEnglish = [
        'Genesis', 'Exodus', 'Leviticus', 'Numbers', 'Deuteronomy', 'Joshua',
        'Judges', 'Ruth', '1 Samuel', '2 Samuel', '1 Kings', '2 Kings', '1 Chronicles',
        '2 Chronicles', 'Ezra', 'Nehemiah', 'Esther', 'Job', 'Psalms', 'Proverbs', 'Ecclesiastes',
        'Song of Solomon', 'Isaiah', 'Jeremiah', 'Lamentations', 'Ezekiel', 'Daniel',
        'Hosea', 'Joel', 'Amos', 'Obadiah', 'Jonah', 'Micah', 'Nahum', 'Habakkuk', 'Zephaniah',
        'Haggai', 'Zechariah', 'Malachi', 'Matthew', 'Mark', 'Luke', 'John', 'Acts', 'Romans',
        '1 Corinthians', '2 Corinthians', 'Galatians', 'Ephesians', 'Philippians', 'Colossians',
        '1 Thessalonians', '2 Thessalonians', '1 Timothy', '2 Timothy', 'Titus', 'Philemon',
        'Hebrews', 'James', '1 Peter', '2 Peter', '1 John', '2 John', '3 John', 'Jude', 'Revelation'
    ];

    static chapNamesInTelugu = [
        'ఆదికాండము', 'నిర్గమకాండము', 'లేవీయకాండము', 'సంఖ్యాకాండము', 'ద్వితీయోపదేశకాండమ', 'యెహొషువ',
        'న్యాయాధిపతులు', 'రూతు', 'సమూయేలు మొదటి గ్రంథము', 'సమూయేలు రెండవ గ్రంథము', 'రాజులు మొదటి గ్రంథము',
        'రాజులు రెండవ గ్రంథము', 'దినవృత్తాంతములు మొదటి గ్రంథము', 'దినవృత్తాంతములు రెండవ గ్రంథము', 'ఎజ్రా', 'నెహెమ్యా', 'ఎస్తేరు', 'యోబు గ్రంథము',
        'కీర్తనల గ్రంథము', 'సామెతలు', 'ప్రసంగి', 'పరమగీతము', 'యెషయా గ్రంథము', 'యిర్మీయా', 'విలాపవాక్యములు', 'యెహెజ్కేలు',
        'దానియేలు', 'హొషేయ', 'యోవేలు', 'ఆమోసు', 'ఓబద్యా', 'యోనా', 'మీకా', 'నహూము', 'హబక్కూకు', 'జెఫన్యా',
        'హగ్గయి', 'జెకర్యా', 'మలాకీ', 'మత్తయి సువార్త', 'మార్కు సువార్త', 'లూకా సువార్త', 'యోహాను సువార్త', 'అపొస్తలుల కార్యములు',
        'రోమీయులకు', '1 కొరింథీయులకు', '2 కొరింథీయులకు', 'గలతీయులకు', 'ఎఫెసీయులకు', 'ఫిలిప్పీయులకు',
        'కొలొస్సయులకు', '1 థెస్సలొనీకయులకు', '2 థెస్సలొనీకయులకు', '1 తిమోతికి', '2 తిమోతికి', 'తీతుకు', 'ఫిలేమోనుకు',
        'హెబ్రీయులకు', 'యాకోబు', '1 పేతురు', '2 పేతురు', '1 యోహాను', '2 యోహాను', '3 యోహాను', 'యూదా', 'ప్రకటన గ్రంథము'
    ];

    static capitalizeFirstLetter(val: string): string {
        return val.charAt(0).toUpperCase() + val.slice(1);
    }
}
